/**
 * Урок 1.
 */
public class VariableNamesTheme {
  /**
  * Задание на тему "именование переменных".
  */
  public static void main(String[] args) {
    System.out.println("1. Разные переменные");

    //цифра
    int digit = 1;
    System.out.println("цифра = " + digit);

    //сумма чисел
    int sumOfNumbers = 5;
    System.out.println("сумма чисел = " + sumOfNumbers);

    //произведение цифр
    int productOfNumbers = 4;
    System.out.println("произведение цифр = " + productOfNumbers);

    //максимальное число
    int maxNumber = 10;
    System.out.println("максимальное число = " + maxNumber);

    //количество десятков
    int amountOfTens = 2;
    System.out.println("количество десятков = " + amountOfTens);

    //вес собаки
    int weightOfDog = 15;
    System.out.println("вес собаки = " + weightOfDog);

    //исходное число
    int originalNumber = 5;
    System.out.println("исходное число = " + originalNumber);

    //процент по вкладу
    int percentOfDeposit = 12;
    System.out.println("процент по вкладу = " + percentOfDeposit);

    //переменная хранит символ
    char variableStoreChar = 'a';
    System.out.println("переменная хранит символ = " + variableStoreChar);

    //код ошибки
    int codeError = 16;
    System.out.println("код ошибки = " + codeError);

    //тип сообщения
    int typeOfMessage = 1;
    System.out.println("тип сообщения = " + typeOfMessage);

    //число нулей
    int numberOfZeros = 5;
    System.out.println("число нулей = " + numberOfZeros);

    //уникальное число
    int uniqNumber = 11;
    System.out.println("уникальное число = " + uniqNumber);

    //случайное число
    int randomNumber = 16;
    System.out.println("случайное число = " + randomNumber);

    //математическое выражение
    char mathStatement = '+';
    System.out.println("математическое выражение = " + mathStatement);

    //выбор
    int choice = 2;
    System.out.println("выбор = " + choice);

    //счет в игре
    int scoreInGame = 6;
    System.out.println("счет в игре = " + scoreInGame);

    //максимальная длина
    int maxLength = 20;
    System.out.println("максимальная длина = " + maxLength);

    //пункт меню
    int itemOfMenu = 1;
    System.out.println("пункт меню = " + itemOfMenu);

    //стоимость кофе на вынос
    int takeAwayCoffeePrice = 60;
    System.out.println("стоимость кофе на вынос = " + takeAwayCoffeePrice);

    //дата начала
    int startDate = 20;
    System.out.println("дата начала = " + startDate);

    //окончание диапазона
    int endOfBand = 40;
    System.out.println("окончание диапазона = " + endOfBand);

    //полное имя работника месяца
    String fullNameEmployeeOfMonth = "Ящер Питерский";
    System.out.println("полное имя работника месяца = " + fullNameEmployeeOfMonth);

    //заголовок электронной книги
    String captionOfDigitalBook = "Пиши, сокращай 2025";
    System.out.println("заголовок электронной книги = " + captionOfDigitalBook);

    //размер
    int size = 50;
    System.out.println("размер = " + size);

    //вместимость
    int capacity = 10;
    System.out.println("вместимость = " + capacity);

    //счетчик
    int counter = 0;
    System.out.println("счетчик = " + counter);

    //путь до файла
    String pathToFile = "home/startjava";
    System.out.println("путь до файла = " + pathToFile);

    //количество чисел в каждой строке
    int amountOfNumbersInEachRow = 15;
    System.out.println("количество чисел в каждой строке = " + amountOfNumbersInEachRow);

    System.out.println("\n2. boolean-переменные");

    //сотни равны?
    boolean isHundredsEqual = true;
    System.out.println("сотни равны? = " + isHundredsEqual);

    //компьютер включен?
    boolean isComputerOn = false;
    System.out.println("компьютер включен? = " + isComputerOn);

    //есть равные цифры?
    boolean hasEqualNumbers = true;
    System.out.println("есть равные цифры? = " + hasEqualNumbers);

    //создано?
    boolean isCreated = false;
    System.out.println("создано? = " + isCreated);

    //пустое?
    boolean isEmpty = true;
    System.out.println("пустое? = " + isEmpty);

    //активное?
    boolean isActive = false;
    System.out.println("активное? = " + isActive);

    //новое?
    boolean isNew = true;
    System.out.println("новое? = " + isNew);

    //электронная почта действительная?
    boolean isEmailActual = false;
    System.out.println("электронная почта действительная? = " + isEmailActual);

    //имеются уникальные строки?
    boolean hasUniqueRows = true;
    System.out.println("имеются уникальные строки? = " + hasUniqueRows);

    System.out.println("\n3. Аббревиатуры");

    //старый universally unique identifier
    String oldUuid = "oldUuid";
    System.out.println("старый universally unique identifier = " + oldUuid);

    //производитель оперативной памяти
    String ramManufacturer = "ramManufacturer";
    System.out.println("производитель оперативной памяти = " + ramManufacturer);

    //емкость жесткого диска
    String hddCapacity = "hddCapacity";
    System.out.println("емкость жесткого диска = " + hddCapacity);

    //протокол передачи гипертекста
    String http = "http";
    System.out.println("протокол передачи гипертекста = " + http);

    //сокращенный uniform resource locator
    String url = "url";
    System.out.println("сокращенный uniform resource locator = " + url);

    //новый идентификатор клиента
    String newCuid = "newCuid";
    System.out.println("новый идентификатор клиента = " + newCuid);

    //кодировка american standard code for information interchange
    String ascii = "ASCII";
    System.out.println("кодировка american standard code for information interchange = " 
            + ascii);
  }
}